import random
g = ( 'سنگ' , 'کاغذ'  ,'قیچی' , 'exit' )
while True:
    p=input('لطفا یکی از عبارات سنگ و کاغذ و قیچی را انتخواب کنید و یا در غیر اینصورت برای خارج  شدن از بازی کلمه ی  exit رابنویسید')
    if p=='exit':
        print ('خداروشکر خودت فهمیدی ی بازنده ای :(((((( ')
        break
    elif p not in g :
        print('داداش خنگی؟ درست عبارتو بزن دیگه')
        continue
    c = random.choice(g)
    print('من اینو اوردم داداش ' , c)
    if p==c:
        print('پراااااااام ایکیو هامون یکیهههههه مساوی شدیم')
    elif g=='سنگ'and c == 'قیچی':
        print('متاسفانه تو بردی -_-')
    elif g=='قیچی'and c=='کاغذ':
        print ('متاسفانه تو بردی -_-')
    elif g=='کاغذ'and c=='سنگ':
        print('متاسفانه بردی -_-')
    else:
        print('من بردمو من بردم چلو کبابو من خوردم')
        break